app/controllers/courses_controller.rb

SELECT "teachers".* FROM "teachers"
SELECT "students".* FROM "students"
---
  def new
    @course = Course.new
    @teachers = Teacher.all
    @students = Student.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers"
SELECT "students".* FROM "students"
SELECT  "courses".* FROM "courses" WHERE "courses"."name" = ? AND "courses"."teacher_id" = ? LIMIT ?  [["name", "Math 3"], ["teacher_id", 3], ["LIMIT", 1]]
---
  def edit
    args = params[:id].split("-")
    @teacher = Teacher.find(args[0])
    @teachers = Teacher.all
    @students = Student.all
    @course = Course.find_by(name: args[1], teacher_id: @teacher.id)

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."name" = ? AND "courses"."teacher_id" = ? LIMIT ?  [["name", "Math 3"], ["teacher_id", 3], ["LIMIT", 1]]
---
  def show
    args = params[:id].split("-")
    @teacher = Teacher.find(args[0])
    @course = Course.find_by(name: args[1], teacher_id: @teacher.id)