app/controllers/students_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @student = Student.new
    @schools = School.all

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Daniel"], ["age", 5], ["created_at", "2020-01-10 16:04:57.275704"], ["updated_at", "2020-01-10 16:04:57.275704"], ["school_id", 7]]
---
  def create
    @student = Student.create(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"
---
  def edit
    @student = Student.find(params[:id])
    @schools = School.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_id", 9], ["updated_at", "2020-01-10 15:58:10.106920"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE (name LIKE '%a%') ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def search
    @school = School.find(params[:school])
    @students = @school.students.where("name LIKE ?", "%#{params[:name]}%")