app/controllers/teachers_controller.rb

  def update
    @teacher = Teacher.find(params[:id])
    @teacher.update(teacher_params)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "name" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["name", "Daniel"], ["updated_at", "2020-01-10 19:29:49.229750"], ["id", 1]]

  def delete
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 1]]

  def create
    @teacher = Teacher.create(teacher_params)
---
INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Daniel"], ["created_at", "2020-01-10 21:09:13.999351"], ["updated_at", "2020-01-10 21:09:13.999351"]]

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]